@antonbabenko thanks, that is much cleaner :) 

The trouble I'm having now is that if I now remove zone_id or zone_name then ALL my resources want to update because they think something has changed...

```
 # module.route53_records["domain1.com"].aws_route53_record.this[" MX"] must be replaced
-/+ resource "aws_route53_record" "this" {
      + allow_overwrite = false
      ~ fqdn            = "domain1.com" -> (known after apply)
      ~ id              = "Z03935533A00000OSDBSM_domain1.com_MX" -> (known after apply)
      ~ name            = "domain1.com" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }
```
If I add both zone_id and zone_name and go back to v1.2.3 then it's fine...